KURS_INFO = ('Каждый из курсов А1, А2 и В1 это 28 видео-уроков и большое '
             'количество заданий на платформе Edvibe.com. После покупки '
             'курса мы создадим для вас аккаунт на этом сайте.\n\nОдин курс '
             ' - это '
             'полный уровень немецкого языка. После прохождения, вы будете '
             'знать всю необходимую грамматику и лексику для уровня. '
             'Заниматься на курсе можно в удобное вам время.\n\nНемного '
             'о тарифах.\n\n"Самостоятельно"\nВы получаете полный доступ к '
             'курсу, всем видео и заданиям. Вы можете смотреть уроки, '
             'выполнять тестовые, устные и письменные задания. Обратной '
             'связи на этом тарифе нет.\n\n"Куратор"\nВсе из тарифа '
             '"Самостоятельно" + ваши письменные задания будет проверять '
             'куратор Полина, а устные задания вы будете сдавать в телеграм '
             'голосовыми сообщениями куратору Анастасии. Она также сможет '
             'ответить на все ваши вопросы. Кроме того, у вас будут конспекты '
             'для уроков. Вы сможете их распечатать и заполнять при просмотре '
             'видео.\n\n"С Региной"\nЭто полностью индивидуальное '
             'обучение, по отдельной программе с ежедневными созвонами '
             'со мной. Корректирую программу обучения под вас и выбираем '
             'удобное для вас время для обучения \U0001F60A')

KURS_PREVIEW = (
    'Ссылки на первый бесплатный урок курсов по уровням:\n\n'
    'А1 - '
    'https://edvibe.com/course/a5566462-c11c-4521-836c-c5ea8adf7e55 \n\n'
    'А2 - '
    'https://edvibe.com/course/ceb2df09-1f7a-4cf1-b945-7e5067372a21 \n\n'
    'В1 - '
    'https://edvibe.com/course/2d90fe61-68ed-4aa2-a410-d205a7898763 \n\n'
)

MARA = ('Марафоны, это ежедневные небольшие уроки на платфомре Edvibe.com.\n\n'
        'После страта марафона, уроки будут открываться каждый день в 12:00 '
        'по Московскому времени. Ежедневные занятия, это хорошая привычка, '
        'которая помогает лучше запомнить теорию и отработать навыки языка '
        'на практике в заданиях. Важно понимать, что марафон это не '
        'полноценный курс по уровню. В нем нет всей необходимой теории. '
        'Его нужно рассматривать как дополнение к нашим курсам, которое '
        'поможет дополнительно потренироваться в немецком языке и узнать '
        'что-то новое \U0001F929\n\nНа марафонах нет рассрочки, так как уроки '
        'открываются автоматически и мы не можем вручную контролировать '
        'количество открытых уроков.')

MARA_PREVIEW = (
    'Ссылки на бесплатные уроки по марафонам:\n\n'
    '100 немецких предлогов - '
    'https://edvibe.com/SharingMaterial/8f43fd05-e7d9-437e-ae6a-e6b3f367cc39'
    '\n\n'
    '100 дней немецкого - '
    'https://edvibe.com/SharingMaterial/dfd68af0-c553-40fa-b565-3c3ea768b7a0'
    '\n\n'
    '50 дней немецкого - '
    'https://edvibe.com/SharingMaterial/ff735329-9e06-4d6e-a161-65e1a08365b6'
    '\n\n'
    'Адвент-марафон - '
    'https://edvibe.com/SharingMaterial/8c9f483c-049e-4054-a932-224f4e437139'
)

PRICE = ('Цены курсов А1, А2 и В1 по тарифам:\n\n'
         'Самостоятельно - 8 900 ₽ / 138 €\n'
         'Куратор - 13 900 ₽ / 216 €\nС Региной 150 000 ₽ / 2300 €\n\n'
         'Цена в евро по текущему курсу.')

RASS = ('Есть рассрочка на два или четыре платежа. Это без процентов '
        'и без банков. Просто делим платёж и открываем оплаченное '
        'количество уроков \U0001F60A')

EURO = ('Да, конечно. Мы настроили прием платежей из европы '
        'через Казахстан. Для вас это просто оплата картой, как обычно '
        'происходит в интернет-магазине.\n'
        'Желательно оплачивать картой Visa или Master Card. '
        'С местными картами могут быть проблемы с оплатой.')

KURS_TIME = ('У вас будет 1 год, чтобы пройти курс или марафон. '
             'Это не наше ограничение, так работает платформа Edvibe. '
             'По истечении года, если у вас будет закрыт доступ, '
             'мы можем обновить ваш курс, но тогда сбросится весь прогресс. '
             'Вы сможете смотреть все уроки, и даже выполнить '
             'задания снова, при желании \U0001F929')

EXAM = ('Курсы А1, А2 и В1 дают всю необходимую информацию для уровня. '
        'Вы будете знать грамматику и лексику, которые нужны '
        'для сдачи экзамена.\nВ нашем аккаунте с отзывами '
        'https://www.instagram.com/otzyvydeutsch/ есть фото сертификатов '
        'наших учеников, которые сдали экзамен после курса \U0001F60A\n'
        'Но нужно понимать, что к экзамену стоит подготовиться отдельно. '
        'Просто посмотреть инфомрацию, как он проходит и порешать '
        'примеры. Чтобы вы не растерялись на экзамене.\n'
        'Наш курс по подготовке еще в разработке. По готовности '
        'разместим его на сайте \U0001F609')

CHILD = ('Изначально, курсы ориентированы на взрослых, '
         'но у нас были дети на обучении от 8 лет и старше. '
         'Проблем с пониманием быть не должно, все объясняется '
         'простым языком. ')

HOMEWORK = ('Тестовые задания проверяются на платформе автоматически. '
            'Вы увидите правильный ответ после выбора. Для устных и '
            'письменных заданий на самостоятельном тарифе есть ответы, '
            'для проверки.\nНа тарифе с куратором, устные задания '
            'сдаются голосовыми сообщениями в телеграм. Куратор дает по '
            'ним обратную связь текстом и, при необходимости, '
            'голосовыми сообщениями.\nПисьменные задания проверяются на '
            'платформе. Чтобы куратор увидел выполненный урок, нужно '
            'отправить его на проверку, после выполнения \U0001F44D')

MY_LEVEL = ('Если вы затруднятесь с выбором курса, потому что не знаете '
            'свой уровень, то можете пройти один из наших тестов.\n\n'
            'Тест А1 - https://forms.gle/6HqbvnHh8ckFthe88 \n'
            'Тест А2 - https://forms.gle/yiZNy3WUdYh2QUab9 \n'
            'Тест В1 - https://forms.gle/kAK4YJoC7Bgn5XPa9 \n\n'
            'Выбирайте ответы честно! Если не знаете ответ, лучше '
            'пропустите вопрос. Правильные '
            'ответы и результат будут показаны после прохождения теста. '
            'Вам нужно будет нажать на кнопку - ПОСМОТРЕТЬ БАЛЛЫ. '
            'Если правильных ответов меньше 60%, мы рекомендуем '
            'повторить уровень, но решение всегда за вами. Можете '
            'написать нам в личные сообщения, если нужна помощь с '
            'выбором курса после теста.')

ELSE_QUESTION = ('Напишите нам вот в этот аккаунт https://t.me/Hastred '
                 'Вам ответит мой муж Сергей \U0001F60A')
